---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeSegment
source: html/a295ca1d-66f2-f788-5079-4d91554a4223.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSegment

The PipeSegment class represents an instance of pipe segment which has the design
 data for routing preference.

## Syntax (C#)
```csharp
public class PipeSegment : Segment
```